#+title: University of Regina, CS 115, Winter 2025
#+subtitle: CS 115
#+AUTHOR: Dr. Joseph Eremondi, adapted from Dr. Shakil Khan, Dr. Philip Fong, and Dr. Howard Hamilton
#+DATE: Last updated: \today{}



#+OPTIONS: toc:nil H:2 TODO:nil eval:yes

#+BEAMER_HEADER: \usepackage[sfdefault]{atkinson} %% Option 'sfdefault' if the base
#+BEAMER_HEADER: \usepackage{FiraMono}
#+BEAMER_HEADER: \usepackage[T1]{fontenc}




#+EXPORT_FILE_NAME: pdf/slides_all.pdf
#+startup: beamer
#+LaTeX_CLASS:beamer
#+BEAMER_CLASS_OPTIONS: [bigger, aspectratio=169, dvipsnames]
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col)
#+beamer: \beamerdefaultoverlayspecification{<+->}


# -*- org-latex-packages-alist: nil; -*-

# #+BEAMER_HEADER: \renewcommand{\pageword}{}


# #+BEAMER_HEADER: \usetheme[customfont,nofooter]{pureminimalistic}
#+BEAMER_HEADER: \usetheme{moloch}
# #+BEAMER_HEADER:\definecolor{textcolor}{RGB}{0, 0, 0}
#+BEAMER_HEADER:\definecolor{title}{RGB}{2, 71, 49}
# #+BEAMER_HEADER:\renewcommand{\beamertextcolor}{textcolor}
# #+BEAMER_HEADER:\renewcommand{\beamerfootertextcolor}{footercolor}
# #+BEAMER_HEADER:\renewcommand{\beamertitlecolor}{title}
# #+BEAMER_HEADER:\setbeamertemplate{frametitle}{\\setbeamercolor{alerted text}{fg=black}
#+BEAMER_HEADER: \setbeamercolor{alerted text}{fg=black}
#+BEAMER_HEADER: \setbeamerfont{alerted text}{series=\bfseries}
#+BEAMER_HEADER: \newcommand{\colored}[2]{{\color{#1} #2}}


#+LATEX_HEADER: \newcommand{\colored}[2]{{\color{#1} #2}}


#+BEAMER_HEADER: \usepackage[utf8]{inputenc}
#+BEAMER_HEADER: \usepackage[libertine]{newtxmath}
#+BEAMER_HEADER: \usepackage{semantic}
#+BEAMER_HEADER: \usepackage{stmaryrd}
#+BEAMER_HEADER: \mathlig{=>}{\Rightarrow}
#+BEAMER_HEADER: \definecolor{LightGray}{gray}{0.9}
#+BEAMER_HEADER: \usepackage[outputdir=pdf]{minted}
#+BEAMER_HEADER: \usepackage{etoolbox}
#+BEAMER_HEADER: \usepackage{hyphenat}
#+BEAMER_HEADER: \AtBeginEnvironment{minted}{\pause}
*** Bubble Sort Code
#+begin_src C++ :noweb strip-export :exports both
typedef int ItemType;
<<swap>>
void bubbleSort(ItemType A[], int N){
  for (int i = 0; i < N-1; i++){
    for (int j = 0; j < (N-1)-i; j++){
      if (A[j] > A[j+1]){
        swap(A[j], A[j+1]);
      }}}}

int main(){
  int A[10] = {2, 3, 5, 4, 1, 4, 99, 3000, 0, -33};
  bubbleSort(A, 10);
  for (int i = 0; i < 10; i++){
    cout << A[i] << " ";
  } cout << endl;
}

#+end_src

#+RESULTS:
: -33 0 1 2 3 4 4 5 99 3000

*** Array Example
- Example:
  #+begin_src C++ :exports both
  int main(){
  int A[5] = {1, 2, 3, 4, 5};
  int i = 3;
  cout << A[i] << endl; //Adds i to address A

  // Also works, but is terrible
  cout << i[A] << endl; //Adds A to address i, same result
  }
  #+end_src

  #+RESULTS:
  | 4 |
  | 4 |

